Revit 2027 API
PointCloudInstance.GetScanOrigin Method
 Returns the origin point of a scan in model coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetScanOrigin(
	string scanName
)
Public Function GetScanOrigin (
	scanName As String
) As XYZ
public:
XYZ^ GetScanOrigin(
	String^ scanName
)
member GetScanOrigin :
        scanName : string -> XYZ
Parameters
scanName String
 Name of the scan.
Return Value
XYZ
 Resulting origin point of the scan.
Exceptions
Exception | Condition
ArgumentException |  PointCloudInstance does not contain scan scanName.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudInstance Class
Autodesk.Revit.DB Namespace